; domain
(define (domain Guarinis_domain)
(:requirements :strips :typing :negative-preconditions)
(:predicates
    (at ?figure ?row ?col)
    (diff_by_one ?row ?col)
    (diff_by_two ?row ?col)
    (clean ?row ?col)
)
(:action knight_move
    :parameters (
        ?knight
        ?from_row ?from_col ?to_row ?to_col
    )
    :precondition (and 
        (clean ?to_row ?to_col)
        (at ?knight ?from_row ?from_col)
        (or
            (and
                (diff_by_two ?from_row ?to_row)
                (diff_by_one ?from_col ?to_col)
            )
            (and 
                (diff_by_one ?from_row ?to_row)
                (diff_by_two ?from_col ?to_col)
            )
        )
    )
    :effect (and
            (not (at ?knight ?from_row ?from_col))
            (at ?knight ?to_row ?to_col)
            (not (clean ?to_row ?to_col))
            (clean ?from_row ?from_col) 
    )
)
)

; problem
(define (problem test_case) (:domain Guarinis_domain)
(:objects 
    n1 n2 n3
    b_k_1 b_k_2 w_k_1 w_k_2
)

(:init
    (at b_k_1 n1 n3)
    (at b_k_2 n3 n3)
    (at w_k_2 n3 n1)
    (at w_k_1 n1 n1)
    (diff_by_one n1 n2)
    (diff_by_one n2 n1)
    (diff_by_one n2 n3)
    (diff_by_one n3 n2)
    (diff_by_two n1 n3)
    (diff_by_two n3 n1)
    (clean n1 n2)
    (clean n2 n1)
    (clean n2 n2)
    (clean n2 n3)
    (clean n3 n2)
)

(:goal (and
    (and
        (at w_k_2 n1 n3)
        (at w_k_1 n3 n3)
        (at b_k_2 n1 n1)
        (at b_k_1 n3 n1)
    )
))
)

; plan
1. (knight_move w_k_1 n1 n1 n2 n3)
   deleted: (at w_k_1 n1 n1) (clean n2 n3)
   added: (at w_k_1 n2 n3) (clean n1 n1)
   goals met: 0 of 1
2. (knight_move b_k_1 n1 n3 n3 n2)
   deleted: (at b_k_1 n1 n3) (clean n3 n2)
   added: (at b_k_1 n3 n2) (clean n1 n3)
   goals met: 0 of 1
3. (knight_move b_k_2 n3 n3 n2 n1)
   deleted: (at b_k_2 n3 n3) (clean n2 n1)
   added: (at b_k_2 n2 n1) (clean n3 n3)
   goals met: 0 of 1
4. (knight_move b_k_1 n3 n2 n1 n1)
   deleted: (at b_k_1 n3 n2) (clean n1 n1)
   added: (at b_k_1 n1 n1) (clean n3 n2)
   goals met: 0 of 1
5. (knight_move b_k_2 n2 n1 n1 n3)
   deleted: (at b_k_2 n2 n1) (clean n1 n3)
   added: (at b_k_2 n1 n3) (clean n2 n1)
   goals met: 0 of 1
6. (knight_move w_k_2 n3 n1 n1 n2)
   deleted: (at w_k_2 n3 n1) (clean n1 n2)
   added: (at w_k_2 n1 n2) (clean n3 n1)
   goals met: 0 of 1
7. (knight_move w_k_2 n1 n2 n3 n3)
   deleted: (at w_k_2 n1 n2) (clean n3 n3)
   added: (at w_k_2 n3 n3) (clean n1 n2)
   goals met: 0 of 1
8. (knight_move b_k_2 n1 n3 n3 n2)
   deleted: (at b_k_2 n1 n3) (clean n3 n2)
   added: (at b_k_2 n3 n2) (clean n1 n3)
   goals met: 0 of 1
9. (knight_move w_k_1 n2 n3 n3 n1)
   deleted: (at w_k_1 n2 n3) (clean n3 n1)
   added: (at w_k_1 n3 n1) (clean n2 n3)
   goals met: 0 of 1
10. (knight_move b_k_1 n1 n1 n2 n3)
   deleted: (at b_k_1 n1 n1) (clean n2 n3)
   added: (at b_k_1 n2 n3) (clean n1 n1)
   goals met: 0 of 1
11. (knight_move w_k_1 n3 n1 n1 n2)
   deleted: (at w_k_1 n3 n1) (clean n1 n2)
   added: (at w_k_1 n1 n2) (clean n3 n1)
   goals met: 0 of 1
12. (knight_move b_k_1 n2 n3 n3 n1)
   deleted: (at b_k_1 n2 n3) (clean n3 n1)
   added: (at b_k_1 n3 n1) (clean n2 n3)
   goals met: 0 of 1
13. (knight_move w_k_2 n3 n3 n2 n1)
   deleted: (at w_k_2 n3 n3) (clean n2 n1)
   added: (at w_k_2 n2 n1) (clean n3 n3)
   goals met: 0 of 1
14. (knight_move w_k_1 n1 n2 n3 n3)
   deleted: (at w_k_1 n1 n2) (clean n3 n3)
   added: (at w_k_1 n3 n3) (clean n1 n2)
   goals met: 0 of 1
15. (knight_move w_k_2 n2 n1 n1 n3)
   deleted: (at w_k_2 n2 n1) (clean n1 n3)
   added: (at w_k_2 n1 n3) (clean n2 n1)
   goals met: 0 of 1
16. (knight_move b_k_2 n3 n2 n1 n1)
   deleted: (at b_k_2 n3 n2) (clean n1 n1)
   added: (at b_k_2 n1 n1) (clean n3 n2)
   goals met: 1 of 1
